# SetLSByClass

## Description
Procedure SetLSByClass sets the referenced object to use the class attribute line style.

```pascal
PROCEDURE SetLSByClass(h : HANDLE);
```

```python
def vs.SetLSByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class line style is used for the object referenced by h.
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0

## Category
* Object Attributes